# Pandas II - Data Cleaning

_September 17, 2020_

Agenda today:
- Introduction to lambda function
- Introduction to data cleaning in pandas (df.merge and df.   
- Combining DataFrames
- Optional Exercises

In [16]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Part I. Lambda function
lambda functions are known as anonymous functions in Python. It allows you to write one-line functions that are used together with `map()`, `filter()`.

Syntax of lambda function: `lambda arguments:expressions`.

In [2]:
# lambda function with one argument
# lambda function is called an annonymous function 
# since we do not need to give it a name
# way to write one line function

func_1 = lambda x:x+10
func_1(10)

20

<i> 

</i>

In [3]:
(lambda x:x+10)(10)
# wrapped in parentheses and the argument 10 passed to it.

20

In [4]:
# lambda function with multiple arguments
func_2 = lambda x, y, z: x+y+z if z + y > x else x-y+z
func_2(10,12,10)

32

In [4]:
# can chain it to any conditionals
(lambda x: x + 10 if x > 10 else x + 11)(9)

20

map(function, collection)
map takes in a function and a collection and a collection and it maps the function to each element in the function

filter(function, collection)
filter take in a function and a collection and evaluates whether the element in the collection satisfies a condition specified in the function

In [5]:
# exercise: turn the below function into a lambda function
def count_zeros(li):
    """
    return a count of how many zeros are in a list
    """
    count = sum(x == 0 for x in li)
    return count

In [14]:
list(map(lambda x: x > 1, [1,2,3,0,4,0]))
# returns boolean values
# booleans values can be summed up since the computer treats True as 1

[False, True, True, False, True, False]

In [12]:
list(filter(lambda x: x > 1, [1,2,3,0,4,0]))
# return the values that satisfy that condition
# so the length of the list will tell us the count

[2, 3, 4]

In [12]:
len(list(filter(lambda x: x == 0, [1,2,3,0,4,0])))
# here turned into a list to avoid a filter object. 
# filter object does not have a length

2

In [6]:
count_zeros([1,2,4,0])

1

x == 0 for x in list >>>>> evaluates whether x is equal to 0 for x or that element in the list
sum(.....) >>>>> adds up the number

In [ ]:
map(function, collection)
filter(function, collection)

In [ ]:
# your answer here
sum(list(map(lambda x:x == 0,[1,2,4,0])))

## Part II. Data Cleaning in Pandas
You might wonder what the usage of lambda functions are - they are incredibly useful when applied to data cleaning in Pandas. You can apply it to columns or the entire dataframe to get results you need. For example, you might want to convert a column with $USD to Euros, or temperature expressed in Celsius to Fehrenheit. You will learn three new functions:

- `Apply()` - works on both series and dataframe. Can also apply function to one column of a dataframe

- `Applymap()` - only on dataframes

- `Map()` - only on series

Y not just apply? The underlying object in the df is going to be interpreted differently.(in terms of what type is the data interpreted as) 
apply- as a pandas object (eg. string as object), 
applymap- as a base python language (eg. string as string)

In [17]:
# import the dataframe 
df = pd.read_csv('auto-mpg.csv')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [16]:
# examine the first few rows of it 
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320

In [18]:
# check the datatypes of the df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      398 non-null object
weight          398 non-null int64
acceleration    398 non-null float64
model year      398 non-null int64
origin          398 non-null int64
car name        398 non-null object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [19]:
# check whether you have missing values
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
dtype: object

In [20]:
df.isna().sum().any()

False

In [ ]:
# creating new columns - broadcasting

In [ ]:
# check the dataframe

In [25]:
# time to use lambda and apply! with apply, applymap, and map, you never need to "iterate through the rows"

# create a function that takes in the weight as lbs, and return weight in tons 
# with apply, you don't have to do a for loop and iterate through a column

# 1 lb = 0.0005
df['weight_in_tons'] = df['weight'].apply(lambda x: x * 0.005)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,17.520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,18.465
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,17.180
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,17.165
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,17.245

In [ ]:
#Broadcasting: project lower dimension to higher dimension
#superior to lambda bcs faster but lambda function bcs you can 
#chain conditionals to it 
 df ['weight_in_tons_bc'] = df['weight'] * 0.0005

In [21]:
df['years old'] = 120 - df['model year']
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,years old
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,38
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,38
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,38
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,38
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,38

In [25]:
# exercise - create a new column called "years old", which determines how old a car is 
df['years old'] = 120 - df['model year']
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,years old
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,38
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,38
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,38
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,38
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,38

In [32]:
#in lambda if you use if, must finish with else

df['years old'] = df['model year'].apply(lambda x: 120-x if x >= 70 else x)
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,years old
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,13.950,38
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,10.650,38
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,11.475,38
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,13.125,38
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,13.600,38

if you have multiple conditions, might be better to use a helper funtion separately and use that inside the lambda. otherwise you chain the conditions by plugging if after each else beginning with a bracket.... if..(if...(if...)else)else)else

df.copy === creates a copy of the dataframe df or original

In [35]:
#drop methods allows us to drop columns
new_df = df.drop(columns = ['weight_in_tons'], axis = 1) 
#inplace = True)
# inplace (w/o true) will modify original database in place for ever and is a NoneType object
# True for inplace will create a new dataframe. 
new_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,years old
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,50
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,50
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,50
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,50


## Part III. Combining DataFrames in Pandas
There are two methods in Pandas that allow us to combine our DataFrames:

    - df.merge() - allow us to match dataframes on either indices or columns
    - df.concat() - allow us to concatenate two dataframes vertically or horizontally 
    -df.join -is built on top of df.merge, jsut a quick option to use for a simple join without the extra parameters in df.merge

In [26]:
# create some toy dataframes 
import pandas as pd
import numpy as np
small_grades = pd.DataFrame({"students":["Amelia","Justin W","Brendan"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_quiz = pd.DataFrame({"students":["Billy","Cierra","Justin W"],
                            "quiz_score":np.random.randint(0,10,3)})

In [31]:
### join along row is to join vertically, with axis = 0
# join along columns is to join horizontally with axis at 1
combined = pd.concat([small_grades, small_quiz], axis = 1)

#axis 1 -- 5 columns 
#axis 0 -- 6 rows

In [32]:
combined

   students  projects  grades  students  quiz_score
0    Amelia         1      87     Billy           6
1  Justin W         2      94    Cierra           6
2   Brendan         1      99  Justin W           4

<i>Be comfortable explaining joins!! </i>

# <img src = 'sql-joins.png' width = 400>

Based on the diagram above, what are the differences of different types of merge?

In [80]:
print(small_grades)
print(small_quiz)

   students  projects  grades
0    Amelia         1      84
1  Justin W         2      94
2   Brendan         1      90
   students  quiz_score
0     Billy           1
1    Cierra           4
2  Justin W           0

In [3]:
### df.merge
small_grades.merge(small_quiz)
# inner merge

   students  projects  grades  quiz_score
0  Justin W         2      94           0

In [92]:
small_grades.merge(small_quiz, how = 'inner', on = 'students')
#'inner' is default, others are ‘left’, ‘right’, ‘outer’

   students  projects  grades  quiz_score
0  Justin W         2      94           0

In [93]:
# outer merge
small_grades.merge(small_quiz, how = 'outer', on = 'students')

   students  projects  grades  quiz_score
0    Amelia       1.0    84.0         NaN
1  Justin W       2.0    94.0         0.0
2   Brendan       1.0    90.0         NaN
3     Billy       NaN     NaN         1.0
4    Cierra       NaN     NaN         4.0

In [12]:
# right merge
small_grades.merge(small_quiz, how = 'left')
left_on = col_name, right_on = col_name

   students  projects  grades  quiz_score
0    Amelia         1      84         NaN
1  Justin W         2      94         0.0
2   Brendan         1      90         NaN

In [13]:
small_grades.merge(small_quiz, how = 'right')
## use the param left_on and right_on if the col names you are joining on is diff

   students  projects  grades  quiz_score
0  Justin W       2.0    94.0           0
1     Billy       NaN     NaN           1
2    Cierra       NaN     NaN           4

### Data Cleaning - level up with the adult dataset

Dataset documentation:
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

In [33]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
adults = pd.read_csv(url,header = None)

In [34]:
# Check the first few rows 
adults.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [35]:
# add the columns to dataset
columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status','occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country','income']

In [36]:
adults.columns = columns
adults.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'income'],
      dtype='object')

In [37]:
adults.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [38]:
# check the info of dataset
adults.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
capital_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [39]:
adults.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital_status    object
occupation        object
relationship      object
race              object
sex               object
capital_gain       int64
capital_loss       int64
hours_per_week     int64
native_country    object
income            object
dtype: object

In [61]:
# check missing values
#.isna or .isnull
adults.isnull().sum().any()

False

In [62]:
adults.sex.str.contains(" ")

0        True
1        True
2        True
3        True
4        True
         ...
32556    True
32557    True
32558    True
32559    True
32560    True
Name: sex, Length: 32561, dtype: bool

In [63]:
adults.education.str.contains(" ")

0        True
1        True
2        True
3        True
4        True
         ...
32556    True
32557    True
32558    True
32559    True
32560    True
Name: education, Length: 32561, dtype: bool

In [86]:
adults['sex'] = adults['sex'].str.replace(" ","")

In [88]:
adults['education'] = adults['education'].str.replace(" ","")

In [103]:
adults.sex.str.contains(" ")

0        False
1        False
2        False
3        False
4        False
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Name: sex, Length: 32561, dtype: bool

In [96]:
## Need to look at data for any white spaces too!!
adults['sex'] = adults['sex'].astype(str)

In [97]:
adults['sex'].dtypes

dtype('O')

In [95]:
# perform some queries - find the total num female & bachelors

adults.sex.value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [42]:

#['education']

Empty DataFrame
Columns: [age, workclass, fnlwgt, education, education-num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [70]:
adults[2:4]

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K

In [102]:
adults[adults.sex == 'Female']

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
12,23,Private,122272,Bachelors,13,Never-married,Adm-clerical,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32546,37,Private,198216,Assoc-acdm,12,Divorced,Tech-support,Not-in-family,White,Female,0,0,40,United-States,<=50K
32549,43,State-gov,255835,Some-college,10,Divorced,Adm-clerical,Other-relative,White,Female,0,0,40,United-States,<=50K
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [77]:
adults['sex'].dtypes

dtype('O')

In [71]:
adults.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [99]:
#adults[sum(filter(lambda x, y: x == 'Female'),['sex'])]
adults[(adults.sex == 'Female') & (adults.education == 'Bachelors')]['sex'].count()

1619

In [107]:
[[adults.groupby(['education','sex'])]]

[[<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fd9c8566438>]]

In [108]:
#adults.min()
#adults.max()
#adults.count()
#adults.mean()
#adults.median()
adults.describe()

,age,fnlwgt,education-num,capital_gain,capital_loss,hours_per_week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [113]:
adults['age'].median()

37.0

In [ ]:
# seems like we have data anolmaly, find out what that is and fix it 
# hint - tons of entries contain white space, remove it!

In [124]:
adults['income'].str.contains(" ")

0        True
1        True
2        True
3        True
4        True
         ...
32556    True
32557    True
32558    True
32559    True
32560    True
Name: income, Length: 32561, dtype: bool

In [125]:
adults['income'] = adults['income'].str.replace(" ", "")

In [126]:
adults['income'].str.contains(" ")

0        False
1        False
2        False
3        False
4        False
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Name: income, Length: 32561, dtype: bool

In [120]:
# subsetting multiple cols
adults['income']

0         <=50K
1         <=50K
2         <=50K
3         <=50K
4         <=50K
          ...
32556     <=50K
32557      >50K
32558     <=50K
32559     <=50K
32560      >50K
Name: income, Length: 32561, dtype: object

In [123]:
adults['income'].dtypes

dtype('O')

In [127]:
# create a column called income_binary, 1 if >50k and 0 otherwise
adults['income_binary'] = adults['income'].apply(lambda x: 0 if x == '>50K' else 1)

In [128]:
adults['income_binary'].value_counts()

1    24720
0     7841
Name: income_binary, dtype: int64

In [129]:
# get some descriptive statistics of the income distribution 
adults['income_binary'].describe()

count    32561.000000
mean         0.759190
std          0.427581
min          0.000000
25%          1.000000
50%          1.000000
75%          1.000000
max          1.000000
Name: income_binary, dtype: float64

In [130]:
adults['income_binary'].median()

1.0

In [ ]:
adults['income_binary'].plot(kind = 'bar')

KeyboardInterrupt: